#include <stdio.h>
/*
操作符：
    算术操作符
        + - * / %
    移位操作符
        >> <<
    位操作符
        & ^ |
    赋值操作符
        = += -= *= /= &= ^= != >>= <<=
    单目操作符
        ! - + & sizeof ~ -- ++ * (类型)
    关系操作符
        > >= < <= != ==
    逻辑操作符
        && ||
    条件操作符(三目操作符)
        exp1 ? exp2 result1:result2
    逗号表达式
        exp1, exp2, exp3, ...expN
    下标引用、函数调用和结构成员
        [] () . ->
*/
/*
算术操作符
*/
// int main()
// {
//     // 除号的两端都是整数的时候，执行的是整数除法，如果两端只要有一个浮点数就执行浮点数的除法
//     int a = 7 / 2.0;
//     float b = 7 / 2;
//     int c = 7 % 2; // 取模操作 符的两个操作符只能是整数
//     printf("值为：%d\n", a);
//     printf("值为：%d\n", b);
//     printf("值为：%d", c);
//     return 0;
// }

/*
单目操作符
*/
// int main()
// {
//     // sizeof是操作符，是单目操作符
//     int a = 10;
//     printf("值为：%d\n", sizeof(a));   // 4 ---> 字节大小
//     printf("值为：%d\n", sizeof(int)); // 4 ---> 字节大小

//     int arr[10] = {1, 2, 3};
//     printf("值为：%d\n", sizeof(arr));                // 计算的是整个数组的大小
//     printf("值为：%d", sizeof(arr) / sizeof(arr[1])); // 10 数组的元素个数
//     return 0;
// }

/*
逗号表达式
*/
int main()
{
    // 逗号表达式就是逗号隔开的一串表达式
    // 逗号表达式的特点是：从左到右依次计算，整个表达式的姐u哦是最后一个表达式的结果
    int a = 10;
    int b = 20;
    int c = 0;
    int d = (c = a - 2, a = b + c, c - 3);
    printf("值为：%d", d);
    return 0;
}