#include <stdio.h>
int main()
{
    /* 
    单目操作符：
    ! 逻辑非
    ++ 前缀、后缀自增
    -- 前缀、后缀自减
    ~ 按位取反运算符
    + 正号
    - 负号
    * 指针运算符(间接访问操作符，即解引用操作符)
    & 取地址运算符
    sizeof 操作数的字节数(以字节为单位)
    (类型) 强制类型转换运算符
    */

    // sizeof 操作数的字节数(以字节为单位)
    /* 
    计算的是变量所占内存空间的大小，单位是字节
    计算类型所创建的变量占据空间的大小，单位是字节
    */

    // ~ 按位取反运算符
    /* 
    00000000 00000000 00000000 00001010 (补码) - 10  
    11111111 11111111 11111111 11110101 (补码) - ~10
    11111111 11111111 11111111 11110100 (反码) - ~10
    10000000 00000000 00000000 00001011 (原码) - ~10 ----> 结果为 -11

    经典示例:
    int a = 13; // 13的补码：00000000 00000000 00000000 00001101
    // 现在要将倒数第二位数的 0 变成 1
    // 方法：将 1 左移 1 位，然后与 a 进行 按位或 操作
    // 00000000 00000000 00000000 00001101 - 13
    // 00000000 00000000 00000000 00000010 - 1 << 1
    // 00000000 00000000 00000000 00001111 - 13 | (1 << 1)
    a = a | (1 << 1);
    printf("%d\n", a); // 输出结果为 15

    // 再将 a 变回去 --- 再把倒数第二位数的 1 变回 0
    // 方法：将 1 左移 1 位，然后与 a 进行 按位与 操作
    // 00000000 00000000 00000000 00001111 - 15
    // 00000000 00000000 00000000 00000010 - 1 << 1
    // 11111111 11111111 11111111 11111101 - ~(1 << 1)
   
    // 00000000 00000000 00000000 00001100 - 15 & (~(1 << 1))
    a = a & (~(1 << 1));
    printf("%d\n", a); // 输出结果为 13
    */
    int a = 10;
    int b = ~a;
    printf("%d\n", b); // 输出结果为 -11


    return 0;
}